import 'package:dainik_bhaskar/model/state_model.dart';
import 'package:flutter/material.dart';
class StatePage extends StatefulWidget {
  @override
  _StatePageState createState() => _StatePageState();
}

class _StatePageState extends State<StatePage> {
  ScrollController scrollController = ScrollController();
  List<StateModel> stateList;

  void initState(){
    StateNewsList();
    super.initState();
  }
  void StateNewsList(){
    stateList =[
      StateModel(
      headLine: 'अग्रोहा PHC में युवती से छेड़छाड़:दवा लेने आई थी; मौका पाकर एंबुलेंस चालक ने दबोच लिया,',
      description: 'हरियाणा के हिसार जिले में अग्रोहा स्थित PHC प्राइमरी हेल्थ सेंटर में युवती के साथ एंबुलेंस चालक द्वारा छेड़छाड़ की गई है। युवती PHC में दवा लेने के लिए आई थी, तभी मौका देखकर एंबुलेंस चालक विजेंद्र ने उसे दबोच लिया। छेड़छाड़ की यह घटना PHC में लगे सीसीटीवी में कैद हो गई है। हालांकि इस घटना में पीड़िता की तरफ से पुलिस को कोई शिकायत नहीं दी गई है, लेकिन जब PHC इंचार्ज डॉ. संजीव सांवरिया ने घटना का वीडियो देखा तो आरोपी एंबुलेंस चालक के खिलाफ पुलिस में मामला दर्ज करवाया है।'

      'आरोपी विजेंद्र अग्रोहा के पास के गांव किरोड़ी का रहने वाला है। PHC इंचार्ज डॉ. संजीव सावरिया ने बताया कि वह अपने कार्यालय में हेल्थ सेंटर की सीसीटीवी चेक कर रहा था। तब उन्होने देखा कि 28 अगस्त को सुबह करीब 7 बजे एंबुलेंस चालक विजेंद्र ने दवाखाना खोला है। उस समय एक युवती भी वहां पर आ जाती है, जो वहां दवा लेने के लिए आई है। विजेंद्र उसे दवा देने के बहाने पकड़ लेता है और उसके साथ अश्लील हरकत करता है। जब युवती उससे खुद को छुड़वाकर बाहर जाने लगती है तो वह उसका रास्ता रोकता है।'

      'इसके बाद युवती वहां से रोते हुए बाहर चली जाती है। इंचार्ज डॉ. संजीव के अनुसार, हो सकता है युवती ने किसी डर या परेशानी के कारण घटना के बारे में किसी के आगे जिक्र न किया हो, लेकिन हेल्थ सेंटर में एक एंबुलेंस चालक द्वारा किसी अकेली युवती के साथ इस तरह का व्यवहार करना आपराधिक घटना है। इसलिए पुलिस को शिकायत दी गई है। इंचार्ज डॉ. संजीव सांवरिया के अनुसार आरोपी विजेंद्र इससे पहले भी एक लड़की के साथ इसी तरह की गलत हरकत कर चुका है, जिस बारे में अस्पताल में शिकायत भी आई थी, लेकिन आरोपी सुबूतों के अभाव में बच गया था।',
      state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/web2images/521/2021/09/09/molestation_1631158275.jpg'
      ),
      StateModel(
      headLine: 'रेवाड़ी में आज 37 केंद्रों पर कोरोना वैक्सीनेशन:19 गांवों में भी बने सेंटर; 14570 डोज लगाने का लक्ष्य, सिविल अस्पताल में कोवैक्सीन और बाकी कैंपों में कोविशील्ड लगेगी',
      description: 'हरियाणा के रेवाड़ी जिले में आज एक बार फिर कोरोना वैक्सीनेशन के सेंटर बढ़ाए गए हैं। इसके साथ ही डोज भी डबल कर दी गई है। आज जिले में 37 स्थानों पर वैक्सीनेशन होगा, जिसमें 19 गांवों में भी वैक्सीनेशन कैंप लगाए गए हैं। इतना ही नहीं पूरे दिन में 14 हजार 570 डोज लगाई जाएंगी। सिर्फ रेवाड़ी के नागरिक अस्पताल में कोवैक्सीन लगेगी, जबकि बाकी सभी जगह कोविशील्ड की डोज लगेगी। स्वास्थ्य विभाग के अनुसार, कोविशील्ड की 10 हजार 320 डोज ऑनस्पॉट रजिस्ट्रेशन के बाद लगेगी, जबकि 3350 सेकेंड डोज ऑनस्पॉट रजिस्ट्रेशन के बाद लगवाई जा सकती है। इसी प्रकार ऑनलाइन रजिस्ट्रेशन वाली 700 पहली डोज लगेगी, जबकि 200 सेकेंड डोज लगेगी।'

     ' स्वास्थ्य विभाग के शेड्यूल के अनुसार, गुरुवार को रेवाड़ी के नागरिक अस्पताल, एसडीएच कोसली, गांव मुंडलिया, बुढ़ाना, सीएचसी गुरावड़ा, गांव गादला, गांव बोहका, सीएचसी बावल, सीएचसी नाहड़, गांव झाल, गांव कोहारड़, गांव भाकली, पीएचसी गंगायचा अहीर, पीएचसी भाड़ावास, धारूहेड़ा में तहसील के सामने, पीएचसी मसानी, गांव ढूंगरवास, गांव कालाका, पीएचसी फतेहपुरी, गांव बालधन खुर्द, गांव गोठड़ा, गांव मस्तापुर, गांव नैनसुखपुरा, गांव देहलावास गुलाबपुरा, गांव जैनाबाद, पीएचसी बासदूदा, गांव अहरोद, पीएचसी कसौला, पीएचसी संगवाड़ी, गांव मोहम्मदपुर, गांव भूरियावास, पीएचसी बव्वा, सेक्टर-4 रेवाड़ी हूडा डिस्पेंसरी, रेवाड़ी के राज स्कूल, यूपीएचसी कुतुबपुर, यूपीएचसी आकेड़ा में कोविशील्ड की पहली और दूसरी दोनों डोज लगेगी। जबकि रेवाड़ी के नागरिक अस्पताल में कोवैक्सीन की डोज लगेगी।',
          state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/web2images/521/2021/09/09/vaccination17621_1631161495.jpg'
      ),
      StateModel(
      headLine: 'सरकारी स्कूल, जो प्राइवेट स्कूल को दे रहा मात:12वीं तक के स्कूल में 7 कक्षाएं डिजिटल, 2700 विद्यार्थी और 97 शिक्षक, एडमिशन के लिए पास करना पड़ता है टेस्ट',
      description: 'सरकारी स्कूल का नाम लेते ही लोगों के दिमाग में टूटी-फूटी बिल्डिंग, बैठने के लिए चटाई, टूटा ब्लैक बोर्ड, गंदे बाथरूम, पीने के लिए नल का पानी, अलग-अलग ड्रेस में बच्चे, किताबों का अभाव और अन्य चीजें जेहन में आती हैं, लेकिन पानीपत के गांव काबड़ी का सीनियर सेकेंडरी स्कूल इस सोच को बदल रहा है।'

     ' अब तक आपने प्राइवेट स्कूलों में एडमिशन के लिए टेस्ट की बात सुनी होगी। जबकि सरकारी स्कूलों में बच्चों की संख्या बढ़ाने के लिए सरकार प्रभात फेरी और प्रचार-प्रसार कराने के आदेश देती है। लेकिन पानीपत के गांव काबड़ी स्थित सरकारी सीनियर सेकेंडरी स्कूल में प्रवेश के लिए बच्चों को टेस्ट देना पड़ता है।'

     ' ऐसा इसलिए क्योंकि गांव का यह स्कूल शिक्षा और सुविधा के मामले में शहर के अच्छे-अच्छे प्राइवेट स्कूलों को मात देता है। 12वीं तक के इस स्कूल की हर कक्षा के 5-5 सेक्शन हैं। स्कूल में बच्चों की संख्या 2700 है। यहां पढ़ाने वाले शिक्षकों की संख्या भी 97 है, जो जिले के किसी भी स्कूल के शिक्षकों की संख्या से अधिक है।',
          state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/web2images/521/2021/09/08/digi_1631118979.jpg'
      ),
      StateModel(
      headLine: 'रेवाड़ी में टीचर ने किया छात्रा का अपहरण:कोसली के एक प्राइवेट स्कूल में 12वीं कक्षा में पढ़ती है नाबालिग, पिता की शिकायत पर आरोपी के खिलाफ केस दर्ज',
      description: 'हरियाणा के रेवाड़ी में एक प्राइवेट स्कूल के टीचर ने अपनी ही शिष्या का अपहरण कर लिया है। 12वीं में पढ़ने वाली लड़की की उम्र महज 16 साल बताई गई है। छात्रा के पिता ने अध्यापक के खिलाफ नाहड़ चौकी में शिकायत दर्ज कराई है। पुलिस ने भी आरोपी के खिलाफ केस दर्ज करके छात्रा व आरोपी दोनों की तलाश शुरू कर दी है।'

     ' मिली जानकारी के अनुसार, कोसली के एक प्राइवेट स्कूल में पढ़ने वाली 12वीं कक्षा की छात्रा बुधवार सुबह घर से स्कूल जाने के लिए निकली थी, लेकिन उसके बाद वह वापस नहीं लौटी। छात्रा के पिता ने स्कूल में पता किया गया तो जानकारी मिली की छात्रा स्कूल ही नहीं पहुंची। उसके बाद छात्रा की तलाश शुरू की गई।'

      'इस दौरान परिवार को पता चला कि नाबालिग छात्रा का किसी और ने नहीं, बल्कि स्कूल के ही एक अध्यापक ने अपहरण कर लिया है। आरोपी अध्यापक हिंदी का टीचर हैं, उसकी उम्र करीब 23 साल बताई गई है। छात्रा के पिता की शिकायत पर नाहड़ चौकी पुलिस ने आरोपी के खिलाफ केस दर्ज कर लिया है।'

     ' नाहड़ चौकी इंचार्ज राजेश कुमार ने बताया कि पीड़िता के पिता की शिकायत पर आरोपी अध्यापक के खिलाफ केस दर्ज कर लिया गया है। आरोपी की तलाश की जा रही है। जल्द ही आरोपी को गिरफ्तार कर नाबालिग को बरामद किया जाएगा।',
          state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/web2images/521/2021/09/09/whatsapp-image-2021-09-08-at-050441_1631155352.jpeg'
      ),
      StateModel(
      headLine: 'पानीपत में सुहावना हुआ मौसम:सुबह से ही आसमान में काले बादलों का डेरा; तापमान 30 डिग्री पर स्थिर, हवाओं की रफ्तार धीमी, बारिश के आसार',
      description: 'हरियाणा के पानीपत जिले में सुबह से ही आसमान में काले बादलों ने डेरा डाला हुआ है, जिससे मौसम सुहावना बना हुआ है। बादल छाने के कारण तापमान स्थिर है। हालांकि बुधवार के मुकाबले हवाओं की रफ्तार में कमी आई है, लेकिन मौसम विभाग ने गुरुवार को मध्यम से तेज बारिश के आसार जताए हैं। गुरुवार को अधिकतम तापमान 30 डिग्री सेल्सियस रहेगा। हवाओं की रफ्तार 18 किलोमीटर प्रतिघंटा होगी।'

      'बुधवार को सुबह से ही निकली चिलचिलाती धूप ने लोगों को परेशान किया था। धूप के साथ उमस ने लोगों को पसीना-पसीना किया। दिनभर कभी तेज धूप तो कभी घटा छाती रही। गरुवुार को सुबह के समय आसमान में घने बादल छाए दिख, जिस कारण सूर्यदेव के दर्शन भी नहीं हुए। बादलों के छा जाने से तापमान में बढ़ोत्तरी नहीं हुई। हालांकि हवाओं की रफ्तार धीमी पड़ने से ठंडक का अहसास नहीं हुआ।'

      'बारिश थमने से धान को फायदा'

     ' कृषि विज्ञान केंद्र प्रभारी डॉ. राजबीर गर्ग ने बताया कि पानीपत में लगातार 7 दिन तक अच्छी बारिश हुई थी। जिस कारण धान के खेतों में जरूरत से अधिक पानी खड़ा हो गया था। अब मंगलवार और बुधवार को न के बराबर बारिश होने से काफी हद तक पानी सूखा है, जिससे धान की फसल को फायदा होगा।'

     ' शुक्रवार तक मानसूनी बारिश के आसार'

      'मौसम वैज्ञानिक डॉ. मदन खींचड़ ने बताया कि अभी भी हिमालय की तलहटियों में मानसूनी टर्फ रेखा बनी हुई है। जिस कारण मैदानी इलाकों में 10 सितंबर तक मानसून सक्रिय रहने के आसार हैं। गुरुवार और शुक्रवार गरज के साथ मध्यम से तेज बारिश हो सकती है।',
          state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/webp/thumb/540x0/web2images/521/2021/09/09/eb091bd3-97ea-4cbd-af0e-94d46138e252_1631155357.jpg'
      ),
      StateModel(
      headLine: 'रोहतक का पहलवान परिवार हत्याकांड:मंजू से मनन बने शख्स का तर्क- समलैंगिक होना दोष नहीं, प्राकृतिक रचना है, घरवालों को मारना ठीक नहीं, समलैंगिकता को टारगेट करना भी सही नहीं',
      description: 'हरियाणा के रोहतक जिले की झज्जर चुंगी स्थित विजय नगर कालोनी में प्रॉपटी डीलर बबलू पहलवान परिवार हत्याकांड की वजह और कुछ नहीं, बल्कि उनके बेटे अभिषेक उर्फ मोनू का समलैंगिक होना है। अभिषेक के इस रहस्य से पर्दा उठने के बाद समाज के लोग उससे घृणा करने लगे हैं। ऐसे में एक लड़की मंजू, जो जेंडर बदलवाकर मनन बन गई है, उसने अपना तर्क दिया है। वह रामगोपाल कालोनी मे रहता है। मनन कहते हैं कि समलैंगिक होना दोष नहीं है, यह प्राकृतिक रचना है। घरवालों की हत्या करना उचित नहीं है, मगर समलैंगिकता को टारगेट करना भी सही नहीं है। अगर घरवालों ने अभिषेक को समझाने की बजाय उसे समझने पर ज्यादा जोर दिया होता तो शायद आज कहानी कुछ और ही होती।'

     ' लड़कियों जैसा पहनावा शुरू हो पसंद नहीं था, घरवालों की नाराजगी झेली'

     'मनन ने बताया कि 5 वर्ष की उम्र रही होगी, जब चाचा की शादी में मां के पहनाए नए फ्रॉक को फाड़ दिया। लड़कियों जैसा पहनावा शुरू से ही पसंद नहीं था। लड़कों की तरह पेंट-शर्ट पहनता था। ऐसा महसूस होता था कि गलत शरीर में जन्म हुआ है। लड़कों जैसा व्यवहार करने पर डांट भी पड़ जाती थी। स्वजनों की नाराजगी भी झेली। भाई-बहनों से अच्छी बॉडिंग नहीं बना पाया। मुझसे कहा जाता- होश में नहीं हूं। घर और बाहर बार-बार लड़की होने का अहसास दिलाया जाता। मन मार कर जी रहा था। कभी समझ ही नहीं आया, क्यों सब नाराज हो गए हैं।'

     ' लड़कों जैसी थी सारी आदतें'

     ' मनन बताते हैं कि शुरुआत से ही उनकी सारी आदतें लड़कों जैसी रहीं। परिवार वाले सोचते थे कि गलत संगत में पड़ गया हूं। लेकिन यह सब संगत नहीं, मेरे अंदर का पुरुष मुझ से कराता था। मेरी परेशानी मेरा शरीर रहा है। मानसिक तौर पर पूरी तरह से स्वस्थ हूं। मेरा लालन-पोषण एक लड़की की तरह हुआ। माता-पिता ने नाम मंजू रखा। लेकिन बहुत जल्द पता चल गया था कि मेरे शरीर में लड़की नहीं लड़का बसता है। इसके बाद मैं जेंडर बदलवाकर मंजू से मनन बन गया।',
          state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/web2images/521/2021/09/08/mananrohtak_1631122569.jpg'
      ),
      StateModel(
      headLine: 'करनाल में किसानों के लंगर पर आमने-सामने:सुखबीर का दावा- चढूनी ने फोन किया तो मैंने एसजीपीसी प्रधान की ड्यूटी लगाई; धरने में बैठे भाकियू नेता का पलटवार- झूठ बोल रहे हैं SAD प्रधान',
      description: 'करनाल में किसानों की प्रशासन के साथ मीटिंग बेनतीजा रही है। बुधवार को दूसरे दिन भी किसान करनाल सचिवालय के बाहर डटे रहे। इस दौरान किसानों के लिए चलाए जा रहे लंगर को लेकर अकाली दल के प्रधान सुखबीर बादल और हरियाणा के किसान नेता गुरनाम चढूनी आमने-सामने आ गए हैं। दरअसल सुखबीर बादल ने बुधवार दोपहर को बयान दिया कि करनाल में चल रहे प्रदर्शन के दौरान लंगर के लिए गुरनाम चढूनी ने उन्हें फोन किया था। इसके बाद उन्होंने गुरुद्वारा प्रबंधक कमेटी की अध्यक्ष बीबी जागीर कौर से बात कर करनाल के गुरुद्वारों में किसानों के लिए लंगर और पानी का प्रबंध करने के लिए कह दिया। यही नहीं उन्होंने इसकी जानकारी सोशल मीडिया अकाउंट पर भी दी। दूसरी ओर गुरनाम सिंह चढूनी ने करनाल में सचिवालय के सामने ही चल रहे धरने के दौरान सुखबीर के दावों का खंडन किया है। चढूनी ने कहा कि उन्होंने लंगर के लिए कभी भी सुखबीर सिंह बादल को फोन नहीं किया और वह ऐसा क्यों करेंगे, जब समाज सेवी संगठन और गुरुद्वारा साहिब से लंगर किसानों के लिए बन रहा है। उन्हें नहीं पता है कि सुखबीर सिंह बादल इस तरह से बयान क्यों दे रहे हैं और इसके पीछे उनकी मंशा क्या है।',
          state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/web2images/521/2021/09/08/_1631115375.jpg'
      ),
       StateModel(
      headLine: 'भूपेंद्र सिंह हुड्डा ने कहा:नाममात्र बढ़ोतरी किसानों से मजाक',
      description: 'पूर्व मुख्यमंत्री और नेता प्रतिपक्ष भूपेंद्र सिंह हुड्डा ने गेहूं, जौ, चने की एमएसपी में मात्र लगभग दो से ढाई प्रतिशत की बढ़ोत्तरी को नाकाफी बताते हुए, किसानों के साथ मजाक करार दिया है। उन्होंने कहा किसान की फसल की लागत बहुत बढ़ गई है, आज पेट्रोल-डीजल की कीमतें आसमान छू रही हैं। लेबर ,खाद, बीज, दवाई और बाकी रोजमर्रा की चीज़ों के दाम भी रिकॉर्ड ऊंचाई के स्तर पर हैं।'

      'एक तरफ सरकार 2022 तक किसानों की आय डबल करने का वादा करती है और दूसरी तरफ उसे पिछले साल सिर्फ ढाई फीसदी और इस साल घटाकर नाममात्र सिर्फ 2 फीसदी की रेट बढ़ोत्तरी का झुनझुना थमा दिया। यूपीए सरकार के दौरान गेहूं के रेट में हर साल औसतन 9-10 प्रतिशत की बढ़ोत्तरी होती थी।',
           state: 'Haryana',
      avatar: 'https://images.bhaskarassets.com/webp/thumb/540x0/web2images/521/2021/09/09/orig_origorigbhupinder-hooda161771431616295845891630889_1631148585.webp'
      ),


    ];
  }


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Column(
        children: [
          Expanded(
            child: ListView.builder(
                controller: scrollController,
                itemCount: stateList.length,
                shrinkWrap: true,
                itemBuilder: (context, index) => ListTile(
                  title: Text(
                    stateList[index].headLine,maxLines: 2,
                    style: TextStyle(

                      fontWeight: FontWeight.w900,
                      fontSize: 18,
                      color: Colors.black,
                    ),
                  ),
                  subtitle: Text(
                    stateList[index].description,maxLines: 1,
                    style: TextStyle(
                      fontWeight: FontWeight.w300,
                      color: Colors.black,
                      fontSize: 16,
                    ),
                  ),


                  trailing: Container(
                    height: 100,
                    width: 100,
                    decoration: BoxDecoration(
                        image: DecorationImage(
                          fit: BoxFit.fill,
                          image: NetworkImage(stateList[index].avatar),

                        )
                    ),
                  ),
                  onTap: () {
                    print('tap widget');
                  },
                )),
          ),
        ],
      ),
    );
  }
}
